# ~ 인과관계 표시
# 종속변수 ~ 독립변수: 종속, 독립의 인과관계 명확하게
data(cars)
str(cars)

result <- lm(cars$dist~cars$speed)

#y = wx + b = 3.932x -17.579

#lm(cars$speed~cars$dist)

summary(result)
# Call:
#   lm(formula = cars$dist ~ cars$speed)
# 
# Residuals: 오차
#   Min      1Q  Median      3Q     Max 
# -29.069  -9.525  -2.272   9.215  43.201 
# 
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)    
# (Intercept) -17.5791     6.7584  -2.601   0.0123 *   기울기 대입값이 고정 일때 상수계수의 의미가 있는지확인 -> 귀무가설 기각 -> 해당 계수는 유의미하다. 
#   cars$speed    3.9324     0.4155   9.464 1.49e-12 *** 상수 대입값이 고정 일때, 기울기 계수의 의미가 있는지 확인 -> 귀무가설 기각
#   ---
#   Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
# 
# Residual standard error: 15.38 on 48 degrees of freedom
# Multiple R-squared:  0.6511,	Adjusted R-squared:  0.6438 
# 0.6511: 실측치평균 추정치
# F-statistic: 89.57 on 1 and 48 DF,  p-value: 1.49e-12# 

# F-statistic: 세 집단 평균검정 or 두집단의 모 분산 비율값 검정

data(iris)

str(iris)
result <- lm(iris$Petal.Width~iris$Petal.Length)
summary(result)


# > result <- lm(iris$Petal.Width~iris$Petal.Length)
# > summary(result)
# 
# Call:
#   lm(formula = iris$Petal.Width ~ iris$Petal.Length)
# 
# Residuals:
#   Min       1Q   Median       3Q      Max 
# -0.56515 -0.12358 -0.01898  0.13288  0.64272 
# 
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)    
# (Intercept)       -0.363076   0.039762  -9.131  4.7e-16 *** 기울기 대입값이 고정 일때 상수계수의 의미가 있는지확인 -> 귀무가설 기각 -> 해당 계수는 유의미하다. 
#   iris$Petal.Length  0.415755   0.009582  43.387  < 2e-16 *** 상수 대입값이 고정 일때, 기울기 계수의 의미가 있는지 확인 -> 귀무가설 기각 -> 해당 계수는 유의미하다.
#   ---
#   Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
# 
# Residual standard error: 0.2065 on 148 degrees of freedom
# Multiple R-squared:  0.9271,	Adjusted R-squared:  0.9266 
# F-statistic:  1882 on 1 and 148 DF,  p-value: < 2.2e-16


#####################################################################
###과제
result <- lm(iris$Petal.Length~iris$Petal.Width)
result
# Call:
#   lm(formula = iris$Petal.Length ~ iris$Petal.Width)
# 
# Coefficients:
#   (Intercept)  iris$Petal.Width  
# 1.084             2.230  

summary(result)
# > summary(result)
# 
# Call:
#   lm(formula = iris$Petal.Length ~ iris$Petal.Width)
# 
# Residuals:
#   Min       1Q   Median       3Q      Max 
# -1.33542 -0.30347 -0.02955  0.25776  1.39453 
# 
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)    
# (Intercept)       1.08356    0.07297   14.85   <2e-16 *** 기울기 대입값이 고정 일때 상수계수의 의미가 있는지확인 -> 귀무가설 기각 -> 해당 계수는 유의미하다. 
#   iris$Petal.Width  2.22994    0.05140   43.39   <2e-16 *** 상수 대입값이 고정 일때, 기울기 계수의 의미가 있는지 확인 -> 귀무가설 기각 -> 해당 계수는 유의미하다.
#   ---
#   Signif. codes:  
#   0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
# 
# Residual standard error: 0.4782 on 148 degrees of freedom
# Multiple R-squared:  0.9271,	Adjusted R-squared:  0.9266 
# F-statistic:  1882 on 1 and 148 DF,  p-value: < 2.2e-16


# 실측치 평균
r_iris <- mean(iris$Petal.Length)
r_iris
# [1] 3.758

# 추정치
est_iris <- 2.230 * iris$Petal.Width + 1.084
est_iris

#plot(x,y)

plot(iris$Petal.Width, iris$Petal.Length)
plot(iris$Petal.Width, est_iris)
?plot


#총변화량
d_tot <- sum((iris$Petal.Length - r_iris)^2)
#설명된 변화량
e_tot <- sum((est_iris - r_iris)^2)

R_square <- e_tot/d_tot

R_square
# [1] 0.9271594


#> est_iris
#[1] 1.530 1.530 1.530 1.530 1.530 1.976 1.753 1.530 1.530 1.307 1.530 1.530
#[13] 1.307 1.307 1.530 1.976 1.976 1.753 1.753 1.753 1.530 1.976 1.530 2.199
#[25] 1.530 1.530 1.976 1.530 1.530 1.530 1.530 1.976 1.307 1.530 1.530 1.530
#[37] 1.530 1.307 1.530 1.530 1.753 1.753 1.530 2.422 1.976 1.753 1.530 1.530
#[49] 1.530 1.530 4.206 4.429 4.429 3.983 4.429 3.983 4.652 3.314 3.983 4.206
#[61] 3.314 4.429 3.314 4.206 3.983 4.206 4.429 3.314 4.429 3.537 5.098 3.983
#[73] 4.429 3.760 3.983 4.206 4.206 4.875 4.429 3.314 3.537 3.314 3.760 4.652
#[85] 4.429 4.652 4.429 3.983 3.983 3.983 3.760 4.206 3.760 3.314 3.983 3.760
#[97] 3.983 3.983 3.537 3.983 6.659 5.321 5.767 5.098 5.990 5.767 4.875 5.098
#[109] 5.098 6.659 5.544 5.321 5.767 5.544 6.436 6.213 5.098 5.990 6.213 4.429
#[121] 6.213 5.544 5.544 5.098 5.767 5.098 5.098 5.098 5.767 4.652 5.321 5.544
#[133] 5.990 4.429 4.206 6.213 6.436 5.098 5.098 5.767 6.436 6.213 5.321 6.213
#[145] 6.659 6.213 5.321 5.544 6.213 5.098


#결정계수 R^2 SSR/SST??? 아래는 결졍계수 X
# 추정치/실측치 비율 확인, 1에 가까울수록 예측이 잘된 것
# [1] 0.4071315 0.4071315 0.4071315 0.4071315 0.4071315
# [6] 0.5258116 0.4664715 0.4071315 0.4071315 0.3477914
# [11] 0.4071315 0.4071315 0.3477914 0.3477914 0.4071315
# [16] 0.5258116 0.5258116 0.4664715 0.4664715 0.4664715
# [21] 0.4071315 0.5258116 0.4071315 0.5851517 0.4071315
# [26] 0.4071315 0.5258116 0.4071315 0.4071315 0.4071315
# [31] 0.4071315 0.5258116 0.3477914 0.4071315 0.4071315
# [36] 0.4071315 0.4071315 0.3477914 0.4071315 0.4071315
# [41] 0.4664715 0.4664715 0.4071315 0.6444918 0.5258116
# [46] 0.4664715 0.4071315 0.4071315 0.4071315 0.4071315
# [51] 1.1192123 1.1785524 1.1785524 1.0598723 1.1785524
# [56] 1.0598723 1.2378925 0.8818520 1.0598723 1.1192123
# [61] 0.8818520 1.1785524 0.8818520 1.1192123 1.0598723
# [66] 1.1192123 1.1785524 0.8818520 1.1785524 0.9411921
# [71] 1.3565726 1.0598723 1.1785524 1.0005322 1.0598723
# [76] 1.1192123 1.1192123 1.2972326 1.1785524 0.8818520
# [81] 0.9411921 0.8818520 1.0005322 1.2378925 1.1785524
# [86] 1.2378925 1.1785524 1.0598723 1.0598723 1.0598723
# [91] 1.0005322 1.1192123 1.0005322 0.8818520 1.0598723
# [96] 1.0005322 1.0598723 1.0598723 0.9411921 1.0598723
# [101] 1.7719532 1.4159127 1.5345929 1.3565726 1.5939329
# [106] 1.5345929 1.2972326 1.3565726 1.3565726 1.7719532
# [111] 1.4752528 1.4159127 1.5345929 1.4752528 1.7126131
# [116] 1.6532730 1.3565726 1.5939329 1.6532730 1.1785524
# [121] 1.6532730 1.4752528 1.4752528 1.3565726 1.5345929
# [126] 1.3565726 1.3565726 1.3565726 1.5345929 1.2378925
# [131] 1.4159127 1.4752528 1.5939329 1.1785524 1.1192123
# [136] 1.6532730 1.7126131 1.3565726 1.3565726 1.5345929
# [141] 1.7126131 1.6532730 1.4159127 1.6532730 1.7719532
# [146] 1.6532730 1.4159127 1.4752528 1.6532730 1.3565726

